### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
!   resource "aws_lambda_function" "this" {
        id                             = "cataprato-core-lambda"
!       last_modified                  = "2023-08-09T18:23:03.000+0000" -> (known after apply)
!       layers                         = [
-           "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-core-layer-s3:7",
        ] -> (known after apply)
!       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-core-lambda:8" -> (known after apply)
!       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-core-lambda:8/invocations" -> (known after apply)
!       s3_key                         = "lambda-builds/8a70fd95036ff5e124e41720c8eeb97a969dd1b671d04e5ad5178df36191b58c.zip" -> "lambda-builds/a74148fae6b11699785099805b107700f09ee580adc76e3b3a54e6f07df87b1a.zip"
!       s3_object_version              = "Bzv7mnh8N.hj3dxpm5Dtdu51a.BdLQFv" -> "8Sbgu6RSgPIOUFWJ55iVwDPETgZmL4Wl"
        tags                           = {}
!       version                        = "8" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] will be created
+   resource "aws_lambda_permission" "current_version_triggers" {
+       action              = "lambda:InvokeFunction"
+       function_name       = "cataprato-core-lambda"
+       id                  = (known after apply)
+       principal           = "apigateway.amazonaws.com"
+       qualifier           = (known after apply)
+       source_arn          = "arn:aws:execute-api:us-east-1:350131064538:*/*/*/*"
+       statement_id        = "APIGatewayAny"
+       statement_id_prefix = (known after apply)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "4838659627612955870" -> (known after apply)
!       triggers = {
!           "timestamp" = "1691607993266903000" -> "1691627756284946000"
            # (1 unchanged element hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] will be created
+   resource "aws_lambda_layer_version" "this" {
+       arn                         = (known after apply)
+       compatible_runtimes         = [
+           "nodejs18.x",
        ]
+       created_date                = (known after apply)
+       description                 = "Node_modules layer"
+       id                          = (known after apply)
+       layer_arn                   = (known after apply)
+       layer_name                  = "cataprato-core-layer-s3"
+       s3_bucket                   = "cataprato-core-20230809150239447600000001"
+       s3_key                      = "builds/127a3705494a8efc2a0aafa26014726541b1bcdeb28bf33404725c7cdbe5f8ea.zip"
+       s3_object_version           = (known after apply)
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
+       skip_destroy                = false
+       source_code_hash            = (known after apply)
+       source_code_size            = (known after apply)
+       version                     = (known after apply)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "2ec651aaefe3f205be00e5e79d626ae1-19" -> (known after apply)
!       id                     = "builds/a7fc90ab3494e70777613e502d7ec5ba1b307c665562cb6daa27b2a1f26b0cfc.zip" -> (known after apply)
!       key                    = "builds/a7fc90ab3494e70777613e502d7ec5ba1b307c665562cb6daa27b2a1f26b0cfc.zip" -> "builds/127a3705494a8efc2a0aafa26014726541b1bcdeb28bf33404725c7cdbe5f8ea.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "builds/a7fc90ab3494e70777613e502d7ec5ba1b307c665562cb6daa27b2a1f26b0cfc.zip" -> "builds/127a3705494a8efc2a0aafa26014726541b1bcdeb28bf33404725c7cdbe5f8ea.zip"
-       tags                   = {} -> null
!       tags_all               = {} -> (known after apply)
!       version_id             = "2Z4iXYGx49v5dxaflyRmZ1pblTpLByi5" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "zip",
+                       "./dist/function/",
+                       null,
                    ],
                ]
+               filename      = "builds/127a3705494a8efc2a0aafa26014726541b1bcdeb28bf33404725c7cdbe5f8ea.zip"
+               runtime       = "nodejs18.x"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/127a3705494a8efc2a0aafa26014726541b1bcdeb28bf33404725c7cdbe5f8ea.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "2253364730533632749" -> (known after apply)
!       triggers = {
!           "filename"  = "builds/a7fc90ab3494e70777613e502d7ec5ba1b307c665562cb6daa27b2a1f26b0cfc.zip" -> "builds/127a3705494a8efc2a0aafa26014726541b1bcdeb28bf33404725c7cdbe5f8ea.zip"
!           "timestamp" = "1691608005525881000" -> "1691627762244920000"
        }
    }

  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_layer_version" {
!       id       = "2953033557189222667" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "builds/a7fc90ab3494e70777613e502d7ec5ba1b307c665562cb6daa27b2a1f26b0cfc.zip" -> "builds/127a3705494a8efc2a0aafa26014726541b1bcdeb28bf33404725c7cdbe5f8ea.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 7 to add, 1 to change, 4 to destroy.
```
</details>